In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [3]:
path=r"C:\Users\shaik\OneDrive\Documents\users\Data Science\Python\EDA\Salary_Data - Salary_Data.csv"
pd.read_csv(path)

    YearsExperience  Salary
0               1.1   39343
1               1.3   46205
2               1.5   37731
3               2.0   43525
4               2.2   39891
5               2.9   56642
6               3.0   60150
7               3.2   54445
8               3.2   64445
9               3.7   57189
10              3.9   63218
11              4.0   55794
12              4.0   56957
13              4.1   57081
14              4.5   61111
15              4.9   67938
16              5.1   66029
17              5.3   83088
18              5.9   81363
19              6.0   93940
20              6.8   91738
21              7.1   98273
22              7.9  101302
23              8.2  113812
24              8.7  109431
25              9.0  105582
26              9.5  116969
27              9.6  112635
28             10.3  122391
29             10.5  121872

In [4]:
pd.DataFrame()

Empty DataFrame
Columns: []
Index: []

### creat dataframes using list

In [5]:
citys={'Hyderabad','Kamareddy','Secead','Medak'}
passings=[700,1600,900,1500]
citys,passings

({'Hyderabad', 'Kamareddy', 'Medak', 'Secead'}, [700, 1600, 900, 1500])

In [6]:
villages={'gandhi','yrpd','kmr'}
amount=[400,500,200]
villages,amount

({'gandhi', 'kmr', 'yrpd'}, [400, 500, 200])

In [7]:
pd.DataFrame() # create or make a data frame

Empty DataFrame
Columns: []
Index: []

In [8]:
pd.DataFrame(zip(citys,passings))  # orowride data

           0     1
0     Secead   700
1  Hyderabad  1600
2      Medak   900
3  Kamareddy  1500

In [9]:
pd.DataFrame(zip(villages,amount))

        0    1
0  gandhi  400
1     kmr  500
2    yrpd  200

In [10]:
data=zip(citys,passings)  # provide columns
cols=['Citys','Passings']
ind=['W','X','Y','Z']
pd.DataFrame(data,
            columns=cols,
            index=ind)

       Citys  Passings
W     Secead       700
X  Hyderabad      1600
Y      Medak       900
Z  Kamareddy      1500

In [12]:
data=zip(villages,amount)
cols=['Villages','Amount']
ind=['u','v','w']
pd.DataFrame(data,
            columns=cols,
            index=ind)

  Villages  Amount
u   gandhi     400
v      kmr     500
w     yrpd     200

In [14]:
citys={'Hyderabad','Kamareddy','Secead'}  # provide index
passings=[700,1600,900]


data=zip(citys,passings)
cols=['Citys','Passings']
ind=['W','X','Y']
df=pd.DataFrame(data,columns=cols,index=ind)
df

       Citys  Passings
W     Secead       700
X  Hyderabad      1600
Y  Kamareddy       900

In [ ]:
citys=['Banglure','Nzb','Dubai','Usa']  # add new column
df['Names']=citys
df

In [ ]:
df['Names']=['omkar','mahi','asif','sathish'] # updae the existing column
df

In [ ]:
df.drop('Passings',   # drop the column
        axis=1,
       inplace=True)
df

In [ ]:
df.drop('Z',    # drop rows
       axis=0,
       inplace=True)
df

In [ ]:
df.to_csv("file.csv")         # save the data frame
#df.to_excel("file.xlsx")

In [ ]:
pd.read_csv("file.csv")

In [ ]:
df.to_csv("file.csv",index=True)     # remove the index

In [ ]:
pd.read_csv("file.csv")   # than again read the csv file

In [ ]:
Class_intervals={'0-10','10-20','20-30','30-40','40-50','50-60'}
Frequency=[100,200,300,400,500,600]
Class_intervals,frequency

In [ ]:
pd.DataFrame()

In [ ]:
pd.DataFrame(zip(Class_intervals,Frequency))

In [ ]:
###########################

In [ ]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [ ]:
path=r"C:\Users\shaik\OneDrive\Documents\users\Data Science\Python\EDA\Visadataset - Visadataset.csv"
pd.read_csv(path)

In [ ]:
================================================================================================================================

In [ ]:
fruits=['mango','apple','cherry']
price=[40,50,20]
fruits,price

In [ ]:
pd.DataFrame()

In [ ]:
pd.DataFrame(zip(fruits,price))

In [ ]:
data=zip(fruits,price)
cols=['Fruits','Price']
pd.DataFrame(data,
            columns=cols)

In [ ]:
data=zip(fruits,price)
cols=['Fruits','Price']
ind=['A','B','C']
pd.DataFrame(data,columns=cols,index=ind)

In [ ]:
data=zip(fruits,price)
cols=['Fruits','Price']
ind=['A','B','C']
df=pd.DataFrame(data,columns=cols,index=ind)
df

In [ ]:
colour=['orange','Red','pink']
df['colour']=colour
df

In [ ]:
df['Fruits']=['orange','stroberry','cherry']
df

In [ ]:
df['colour']=['blue','purple','sky blue']
df

In [ ]:
data=zip(fruits,price)
cols=['Fruits','price']
ind=['X','Y','Z']
df=pd.DataFrame(data,columns=cols,index=ind)
df

In [ ]:
colour=['sky','black','white']
df['colour']=colour
df

In [ ]:
df.drop('price',
       axis=1,
       inplace=True)
df

In [ ]:
df.drop('Z',
       axis=0,
       inplace=True)
df

In [ ]:
df['Rate']=['one','two']
df

In [ ]:
df.to_csv("data.csv")

In [ ]:
pd.read_csv("data.csv")

In [ ]:
########################

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [ ]:
plt. bar graph

In [ ]:
######################## M-1 ###############################################
plt.figure(figsize=(10,6)) # to incease the plot size
plt.bar('continent',
'count',
data=continent_vc_df)
plt.xlabel("continent") # x-axis name
plt.ylabel('count') # y-axis name
plt.title("Bar chart") # title of the chart
plt.savefig('continent_bar.jpg')
plt.show()
######################## M-2 ###############################################
plt.figure(figsize=(10,6))
# l=['Asia', 'Oceania', 'North America', 'South America', 'Africa',
# 'Europe']
l=visa_df['continent'].value_counts().keys() # order provide automatically
sns.countplot(data=visa_df,
x='continent',
order=l)
plt.xlabel("continent") # x-axis name
plt.ylabel('count') # y-axis name
plt.title("Bar chart") # title of the chart
plt.savefig('continent_bar.jpg')
plt.show()
############################# M-3 ##########################################
values=visa_df['continent'].value_counts()
ax=values.plot(kind='bar')
ax.bar_label(ax.containers[0])